org/org-docs/cutter/cutter.org
* cutter 

  cutter は C/C++ 言語用の単体テストフレームワークです。

  [[http://cutter.sourceforge.net/reference/ja/readme.html][はじめに: Cutterリファレンスマニュアル - Cutter]] をざっと読んでみましょう。使いながら覚えましょう。

* テスト・ファイルの作成

   cutterで*テスト*を行なうためには，テスト用ディレクトリを作成し，テ
   スト用ディレクトリの中に，*テスト*を作成します。

   cutterでのテストは，ディレクトリの中の，test_ で始まるtest_*.so と
   いう名前のテストファイル(達)です。

   テストファイルを作成するため，test_*.c にソースプログラムを書き，コ
   ンパイルして，test_*.so を作成します。

   ここでは，~/progs/cutter/test がテスト用ディレクトリ，
   ~/progs/cutter/test/test_first.c がテストのソースファイルです。
   テスト test_first.so を作成することが目的で，そのためにMakefileを用
   意します。

   まず，テスト用ディレクトリを作成します。
   次のコマンドで行います:

#+BEGIN_SRC sh :dir ~/progs/ :export both
# [~/progs] % 
mkdir -p cutter/test
#+END_SRC

#+RESULTS:

   テストファイルを作成するため，ソースプログラム
   (cutter/test/test_first.c) を作成します：

#+BEGIN_SRC c :tangle ~/progs/cutter/test/test_first.c :mkdirp yes
// ~/progs/cutter/test/test_first.c
#include <cutter.h>
#include <string.h>

static int condition = 0;

void
cut_setup (void)
{
    /* 初期化用コード */
    condition = 1;
}

void
cut_teardown (void)
{
    /* 後片付け用コード */
    condition = 0;
}

void
test_condition(void)
{
    cut_set_message("conditionの値はcut_setup()で1に設定されているはず");
    cut_assert(condition==1);
}

void
test_strcmp(void)
{
    cut_set_message("同じ文字列に対し，strcmpは0を返すはず");
    cut_assert(strcmp("string", "string")==0);
}
#+END_SRC
   
   - cutter.h をインクルードし， cutter が提供する機能のインタフェース
     を受け入れます。

   - string.h をインクルードし，テストしたい文字列機能のインタフェース
     を受け入れます。

   - テストに使う変数 condition を宣言します。

   - cut_setup と cut_teardown 関数は，各テストの前後に呼ばれる初期化
     と後処理のための関数です。ここでは，conditionの値を設定，クリアしています。

   - test_ で始まる関数がテストを行なうテスト関数です。

     テスト関数は，テストのための*表明*を含みます。表明とは，機能が正し
     いときに真となる論理式のことです。

     cutterでの表明は，cut_assert で
     始まる関数に，表明をあらわす論理値を与える呼び出しで書きます。

   - cut_assert(condition==1) は，conditionの値が1であることを確かめる
     ための表明です。

   - cut_assert(strcmp("string", "string")==0) は，strcmp 関数が0を
     返すことを確かめるための表明です。

     cut_assert関数は，その値が真ならテスト成功として，偽ならテスト失
     敗として，振舞います。

   - cut_set_message("message")は　表明が失敗した場合に表示するメッ
       セージを指定します。

* テストのビルド
  
** Makefile

   テストをビルド(作成)するために，makeを使います。Makefileの書き方は，

   [[http://wiki.cis.iwate-u.ac.jp/~cis/prog2/pukiwiki/index.php?12%E5%9B%9E%E7%9B%AE#f623ebec][prog2::make]] を見て，思い出して下さい。

   テストディレクトリの中に Makefile を作成します:

#+BEGIN_SRC makefile :tangle ~/progs/cutter/test/Makefile
# ~/progs/cutter/test/Makefile
CFLAGS = -fPIC `pkg-config cutter --cflags`
LDFLAGS = `pkg-config cutter --libs`

test_first.so: test_first.o
	gcc -o $@ -shared $< $(LDFLAGS)

test_first.o: test_first.c
	gcc -c $< $(CFLAGS)

.PHONY: clean
clean:
	rm -f *.o *.so
#+END_SRC

  - CFLAGS にはコンパイラへの指示を書きます。   

   `pkg-config cutter --cflags` と書くのは，

    '-I /usr/include/cutter'と書くのと同等です。

    '-I' はインクルードパスの指定です。cutter.h のあるディレクトリを指定しています。


  - LDFLAGS にはローダへの指示を書きます。'-lcutter' はライブラリパス
    にある libcutter.a または libcutter.so を意味します。利用環境では，
    /usr/lib/libcutter.soになります。

  - test_first.so がビルドのターゲットです。-share オプションで，共有ライブラリにします。
    main関数は必要ありません。

  - test_first.c をコンパイルしオブジェクト・ファイル test_first.o を
    作ります。このとき CFLAGS変数で，cutter.h の在処を指定しています。

  make してテストをビルドしましょう:

#+BEGIN_SRC sh :results output :exports both :dir ~/progs/cutter/test
# [~/progs/cutter/test] %
 make 
#+END_SRC

#+RESULTS:
: gcc -c test_first.c -fPIC `pkg-config cutter --cflags`
: gcc -o test_first.so -shared test_first.o `pkg-config cutter --libs`

  上記のコマンドが成功すれば，test_first.so が出来上がっています。

* テストのビルドへの補足説明

** コンパイラへの指示

Makefile 中の記述への補足です:

*** include パス

#+BEGIN_SRC sh  :results output :exports both
# 次のコマンドを実行してみてください
pkg-config cutter --cflags

#+END_SRC

#+RESULTS:
: -I/usr/include/cutter  

    この結果を，Cコンパイラのオプションで指定すると，インクルード・パ
    スに~/usr/include/cutter~ を加えることになり，cutter.h がインクルー
    ドできることになります。

*** ライブラリとライブラリ・パス

#+BEGIN_SRC sh  :results output :exports both :dir ~/progs/cutter
# 次のコマンドを実行してみてください
# cutter を使うために必要なライブラリの情報がわかります。
pkg-config cutter --libs
#+END_SRC

#+RESULTS:
: -lcutter  

  - この結果を，Cコンパイラ(実はローダ)のオプションで指定すると，ライ
    ブラリに libcutter.so を加えることになります。

