org/org-docs/cutter.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-11-01 火 05:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Cutterの使い方</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Masayuki Suzuki" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://wiki.cis.iwate-u.ac.jp/~suzuki/org-html-theme/styles/sos/css/sos.css">
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Cutterの使い方</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. cutter</a></li>
<li><a href="#orgheadline2">2. テスト・ファイルの作成</a></li>
<li><a href="#orgheadline4">3. テストのビルド</a>
<ul>
<li><a href="#orgheadline3">3.1. Makefile</a></li>
</ul>
</li>
<li><a href="#orgheadline11">4. テストのビルドへの補足説明</a>
<ul>
<li><a href="#orgheadline7">4.1. コンパイラへの指示</a>
<ul>
<li><a href="#orgheadline5">include パス</a></li>
<li><a href="#orgheadline6">ライブラリとライブラリ・パス</a></li>
</ul>
</li>
<li><a href="#orgheadline8">4.2. ヘッダファイルやライブラリファイルの場所</a></li>
<li><a href="#orgheadline9">4.3. オブジェクト・ファイルのこと</a></li>
<li><a href="#orgheadline10">4.4. ライブラリ・ファイルのこと</a></li>
</ul>
</li>
<li><a href="#orgheadline14">5. テストの実行</a>
<ul>
<li><a href="#orgheadline12">5.1. テスト結果 (成功)</a></li>
<li><a href="#orgheadline13">5.2. テスト結果 (失敗)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> cutter</h2>
<div class="outline-text-2" id="text-1">
<p>
cutter は C/C++ 言語用の単体テストフレームワークです。
</p>

<p>
<a href="http://cutter.sourceforge.net/reference/ja/readme.html">はじめに: Cutterリファレンスマニュアル - Cutter</a> をざっと読んでみましょう。使いながら覚えましょう。
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> テスト・ファイルの作成</h2>
<div class="outline-text-2" id="text-2">
<p>
cutterで*テスト*を行なうためには，テスト用ディレクトリを作成し，テ
スト用ディレクトリの中に，*テスト*を作成します。
</p>

<p>
cutterでのテストは，ディレクトリの中の，test_ で始まるtest_*.so と
いう名前のテストファイル(達)です。
</p>

<p>
テストファイルを作成するため，test_*.c にソースプログラムを書き，コ
ンパイルして，test_*.so を作成します。
</p>

<p>
ここでは，~/progs/cutter/test がテスト用ディレクトリ，
~/progs/cutter/test/test_first.c がテストのソースファイルです。
テスト test_first.so を作成することが目的で，そのためにMakefileを用
意します。
</p>

<p>
まず，テスト用ディレクトリを作成します。
次のコマンドで行います:
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">[~/progs] % </span>
mkdir -p cutter/test
</pre>
</div>

<p>
テストファイルを作成するため，ソースプログラム
(cutter/test/test_first.c) を作成します：
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">~/progs/cutter/test/test_first.c</span>
<span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;cutter.h&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;string.h&gt;</span>

<span style="color: #0000FF;">static</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">condition</span> = 0;

<span style="color: #6434A3;">void</span>
<span style="color: #006699;">cut_setup</span> (<span style="color: #6434A3;">void</span>)
{
    <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">&#21021;&#26399;&#21270;&#29992;&#12467;&#12540;&#12489; </span><span style="color: #8D8D84;">*/</span>
    condition = 1;
}

<span style="color: #6434A3;">void</span>
<span style="color: #006699;">cut_teardown</span> (<span style="color: #6434A3;">void</span>)
{
    <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">&#24460;&#29255;&#20184;&#12369;&#29992;&#12467;&#12540;&#12489; </span><span style="color: #8D8D84;">*/</span>
    condition = 0;
}

<span style="color: #6434A3;">void</span>
<span style="color: #006699;">test_condition</span>(<span style="color: #6434A3;">void</span>)
{
    cut_set_message(<span style="color: #008000;">"condition&#12398;&#20516;&#12399;cut_setup()&#12391;1&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12399;&#12378;"</span>);
    cut_assert(condition==1);
}

<span style="color: #6434A3;">void</span>
<span style="color: #006699;">test_strcmp</span>(<span style="color: #6434A3;">void</span>)
{
    cut_set_message(<span style="color: #008000;">"&#21516;&#12376;&#25991;&#23383;&#21015;&#12395;&#23550;&#12375;&#65292;strcmp&#12399;0&#12434;&#36820;&#12377;&#12399;&#12378;"</span>);
    cut_assert(strcmp(<span style="color: #008000;">"string"</span>, <span style="color: #008000;">"string"</span>)==0);
}
</pre>
</div>

<ul class="org-ul">
<li>cutter.h をインクルードし， cutter が提供する機能のインタフェース
を受け入れます。</li>

<li>string.h をインクルードし，テストしたい文字列機能のインタフェース
を受け入れます。</li>

<li>テストに使う変数 condition を宣言します。</li>

<li>cut_setup と cut_teardown 関数は，各テストの前後に呼ばれる初期化
と後処理のための関数です。ここでは，conditionの値を設定，クリアしています。</li>

<li><p>
test_ で始まる関数がテストを行なうテスト関数です。
</p>

<p>
テスト関数は，テストのための*表明*を含みます。表明とは，機能が正し
いときに真となる論理式のことです。
</p>

<p>
cutterでの表明は，cut_assert で
始まる関数に，表明をあらわす論理値を与える呼び出しで書きます。
</p></li>

<li>cut_assert(condition==1) は，conditionの値が1であることを確かめる
ための表明です。</li>

<li><p>
cut_assert(strcmp("string", "string")==0) は，strcmp 関数が0を
返すことを確かめるための表明です。
</p>

<p>
cut_assert関数は，その値が真ならテスト成功として，偽ならテスト失
敗として，振舞います。
</p></li>

<li>cut_set_message("message")は　表明が失敗した場合に表示するメッ
セージを指定します。</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">3</span> テストのビルド</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">3.1</span> Makefile</h3>
<div class="outline-text-3" id="text-3-1">
<p>
テストをビルド(作成)するために，makeを使います。Makefileの書き方は，
</p>

<p>
<a href="http://wiki.cis.iwate-u.ac.jp/~cis/prog2/pukiwiki/index.php?12%E5%9B%9E%E7%9B%AE#f623ebec">prog2::make</a> を見て，思い出して下さい。
</p>

<p>
テストディレクトリの中に Makefile を作成します:
</p>

<div class="org-src-container">

<pre class="src src-makefile"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">~/progs/cutter/test/Makefile</span>
<span style="color: #BA36A5;">CFLAGS</span> = -fPIC <span style="color: #008000;">`pkg-config cutter --cflags`</span>
<span style="color: #BA36A5;">LDFLAGS</span> = <span style="color: #008000;">`pkg-config cutter --libs`</span>

<span style="color: #0000ff; font-weight: bold;">test_first.so</span>: test_first.o
        gcc -o <span style="color: #0000ff; font-weight: bold;">$</span><span style="color: #D0372D; font-weight: bold;">@</span> -shared $<span style="color: #D0372D;">&lt;</span> $(<span style="color: #BA36A5;">LDFLAGS</span>)

<span style="color: #0000ff; font-weight: bold;">test_first.o</span>: test_first.c
        gcc -c $<span style="color: #D0372D;">&lt;</span> $(<span style="color: #BA36A5;">CFLAGS</span>)

<span style="color: #0000ff; font-weight: bold;">.PHONY</span>: clean
<span style="color: #0000ff; font-weight: bold;">clean</span>:
        rm -f *.o *.so
</pre>
</div>

<ul class="org-ul">
<li><p>
CFLAGS にはコンパイラへの指示を書きます。   
</p>

<p>
`pkg-config cutter &#x2013;cflags` と書くのは，
</p>

<p>
'-I /usr/include/cutter'と書くのと同等です。
</p>

<p>
'-I' はインクルードパスの指定です。cutter.h のあるディレクトリを指定しています。
</p></li>
</ul>


<ul class="org-ul">
<li>LDFLAGS にはローダへの指示を書きます。'-lcutter' はライブラリパス
にある libcutter.a または libcutter.so を意味します。利用環境では，
/usr/lib/libcutter.soになります。</li>

<li>test_first.so がビルドのターゲットです。-share オプションで，共有ライブラリにします。
main関数は必要ありません。</li>

<li>test_first.c をコンパイルしオブジェクト・ファイル test_first.o を
作ります。このとき CFLAGS変数で，cutter.h の在処を指定しています。</li>
</ul>

<p>
make してテストをビルドしましょう:
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">[~/progs/cutter/test] %</span>
 make
</pre>
</div>

<pre class="example">
gcc -c test_first.c -fPIC `pkg-config cutter --cflags`
gcc -o test_first.so -shared test_first.o `pkg-config cutter --libs`
</pre>

<p>
上記のコマンドが成功すれば，test_first.so が出来上がっています。
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11"><span class="section-number-2">4</span> テストのビルドへの補足説明</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">4.1</span> コンパイラへの指示</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Makefile 中の記述への補足です:
</p>
</div>

<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5">include パス</h4>
<div class="outline-text-4" id="text-orgheadline5">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#27425;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12375;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;</span>
pkg-config cutter --cflags
</pre>
</div>

<pre class="example">
-I/usr/include/cutter  
</pre>

<p>
この結果を，Cコンパイラのオプションで指定すると，インクルード・パ
スに~/usr/include/cutter~ を加えることになり，cutter.h がインクルー
ドできることになります。
</p>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6">ライブラリとライブラリ・パス</h4>
<div class="outline-text-4" id="text-orgheadline6">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#27425;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12375;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">cutter &#12434;&#20351;&#12358;&#12383;&#12417;&#12395;&#24517;&#35201;&#12394;&#12521;&#12452;&#12502;&#12521;&#12522;&#12398;&#24773;&#22577;&#12364;&#12431;&#12363;&#12426;&#12414;&#12377;&#12290;</span>
pkg-config cutter --libs
</pre>
</div>

<pre class="example">
-lcutter  
</pre>

<ul class="org-ul">
<li>この結果を，Cコンパイラ(実はローダ)のオプションで指定すると，ライ
ブラリに libcutter.so を加えることになります。</li>
</ul>
</div>
</div>
</div>
