org/org-docs/cutter/cutter.org
** ヘッダファイルやライブラリファイルの場所

  cutter.h や libcutter.so の在処を調べてみましょう:

#+BEGIN_SRC sh :results output :dir ~/progs/cutter
# 次のコマンドを実行してみてください
# cutter.h がある場所がわかります。
locate cutter.h
#+END_SRC

#+RESULTS:
: /usr/include/cutter/cppcutter.h
: /usr/include/cutter/cutter.h
: /usr/include/cutter/gcutter.h
: /usr/include/cutter/soupcutter.h
: /usr/share/gtk-doc/html/cutter/cutter.html
: /usr/share/gtk-doc/html/cutter/ja/cutter.html

  <cutter.h> は /usr/include/cutter/cutter.h ですね。

#+BEGIN_SRC sh :results output :dir ~/progs/cutter
# 次のコマンドを実行してみてください
# libcutter.so がある場所がわかります。
locate libcutter.so
#+END_SRC

#+RESULTS:
: /usr/lib/libcutter.so
: /usr/lib/libcutter.so.0
: /usr/lib/libcutter.so.0.1.0

   -lcutter で指定した libcutter.so は /usr/lib/libbutter.so です。
   /usr/lib はシステムの通常のライブラリを置く場所です。

** オブジェクト・ファイルのこと

#+BEGIN_SRC sh :results output :exports both :dir ~/progs/cutter/test
# [~/progs/cutter/test] % 
# test_first.o の中に何があるか調べましょう。
# 次のコマンドを実行してください。e

nm test_first.o 
#+END_SRC

#+RESULTS:
#+begin_example
000000000000036d s L_.str
00000000000003ad s L_.str1
00000000000003d0 s L_.str2
00000000000003eb s L_.str3
00000000000003f8 s L_.str4
0000000000000440 s L_.str5
000000000000046c s L_.str6
0000000000000473 s L_.str7
00000000000003ba s L___PRETTY_FUNCTION__.test_condition
000000000000042d s L___PRETTY_FUNCTION__.test_strcmp
                 U ___stack_chk_fail
                 U ___stack_chk_guard
00000000000005d0 b _condition
                 U _cut_assert_helper
0000000000000000 T _cut_setup
0000000000000010 T _cut_teardown
                 U _cut_test_context_current_peek
                 U _cut_test_context_finish_user_message_jump
                 U _cut_test_context_get_have_current_result
                 U _cut_test_context_get_jump_buffer
                 U _cut_test_context_in_user_message_jump
                 U _cut_test_context_long_jump
                 U _cut_test_context_pop_backtrace
                 U _cut_test_context_process_current_result
                 U _cut_test_context_push_backtrace
                 U _cut_test_context_set_jump_buffer
                 U _cut_test_context_set_user_message
                 U _cut_test_context_start_user_message_jump
                 U _setjmp
                 U _strcmp
0000000000000020 T _test_condition
00000000000001b0 T _test_strcmp
#+end_example

  test_first.o に入っている変数や関数，参照している関数情報などですね:
  - T は定義されている関数です
  - U は参照している関数です

** ライブラリ・ファイルのこと
    
  test_first.so をいろいろ調べてみましょう.

  まずは，test_first.so が使用しているライブラリを調べてみます。

#+BEGIN_SRC sh :results output :exports both :dir ~/progs/cutter/test
# [~/progs/cutter/test] % 
# test_first.soが使う動的ライブラリを表示するため，
# 次のコマンドを実行してください

ldd test_first.so 
#+END_SRC

#+RESULTS:
#+begin_example
	linux-vdso.so.1 =>  (0x00007fff1f595000)
	libcutter.so.0 => /usr/lib/libcutter.so.0 (0x00007fc59afa4000)
	libc.so.6 => /lib/x86_64-linux-gnu/libc.so.6 (0x00007fc59abdf000)
	libgmodule-2.0.so.0 => /usr/lib/x86_64-linux-gnu/libgmodule-2.0.so.0 (0x00007fc59a9da000)
	libgio-2.0.so.0 => /usr/lib/x86_64-linux-gnu/libgio-2.0.so.0 (0x00007fc59a667000)
	libgobject-2.0.so.0 => /usr/lib/x86_64-linux-gnu/libgobject-2.0.so.0 (0x00007fc59a416000)
	libglib-2.0.so.0 => /lib/x86_64-linux-gnu/libglib-2.0.so.0 (0x00007fc59a10d000)
	libpthread.so.0 => /lib/x86_64-linux-gnu/libpthread.so.0 (0x00007fc599eef000)
	/lib64/ld-linux-x86-64.so.2 (0x00007fc59b456000)
	libdl.so.2 => /lib/x86_64-linux-gnu/libdl.so.2 (0x00007fc599ceb000)
	libz.so.1 => /lib/x86_64-linux-gnu/libz.so.1 (0x00007fc599ad1000)
	libselinux.so.1 => /lib/x86_64-linux-gnu/libselinux.so.1 (0x00007fc5998ae000)
	libresolv.so.2 => /lib/x86_64-linux-gnu/libresolv.so.2 (0x00007fc599693000)
	libffi.so.6 => /usr/lib/x86_64-linux-gnu/libffi.so.6 (0x00007fc59948a000)
	libpcre.so.3 => /lib/x86_64-linux-gnu/libpcre.so.3 (0x00007fc59924c000)
#+end_example

  つぎに test_first.so の中に何が入っているか調べてみます:

#+BEGIN_SRC sh :results output :dir ~/progs/cutter/test
# [~/progs/cutter/test] % 
# test_first.soで定義された，または参照している関数を表示するため，
# 次のコマンドを実行してください

nm test_first.so 
#+END_SRC


#+RESULTS:
#+begin_example
0000000000201e08 d _DYNAMIC
0000000000202000 d _GLOBAL_OFFSET_TABLE_
                 w _ITM_deregisterTMCloneTable
                 w _ITM_registerTMCloneTable
                 w _Jv_RegisterClasses
0000000000001108 r __FRAME_END__
0000000000201e00 d __JCR_END__
0000000000201e00 d __JCR_LIST__
0000000000000ff2 r __PRETTY_FUNCTION__.3239
0000000000001001 r __PRETTY_FUNCTION__.3246
00000000002020a0 d __TMC_END__
00000000002020a0 B __bss_start
                 w __cxa_finalize@@GLIBC_2.2.5
0000000000000bf0 t __do_global_dtors_aux
0000000000201df8 t __do_global_dtors_aux_fini_array_entry
0000000000202098 d __dso_handle
0000000000201df0 t __frame_dummy_init_array_entry
                 w __gmon_start__
00000000002020a0 D _edata
00000000002020a8 B _end
0000000000000ee8 T _fini
0000000000000a48 T _init
                 U _setjmp@@GLIBC_2.2.5
00000000002020a0 b completed.6973
00000000002020a4 b condition
                 U cut_assert_helper
0000000000000c65 T cut_setup
0000000000000c75 T cut_teardown
                 U cut_test_context_current_peek
                 U cut_test_context_finish_user_message_jump
                 U cut_test_context_get_have_current_result
                 U cut_test_context_get_jump_buffer
                 U cut_test_context_in_user_message_jump
                 U cut_test_context_long_jump
                 U cut_test_context_pop_backtrace
                 U cut_test_context_process_current_result
                 U cut_test_context_push_backtrace
                 U cut_test_context_set_jump_buffer
                 U cut_test_context_set_user_message
                 U cut_test_context_start_user_message_jump
0000000000000b80 t deregister_tm_clones
0000000000000c30 t frame_dummy
0000000000000bb0 t register_tm_clones
0000000000000c85 T test_condition
0000000000000dbb T test_strcmp
#+end_example

* テストの実行
  
  作成したテストを実行します:

#+BEGIN_SRC sh :results output code :exports both :dir ~/progs/cutter
# [~/progs/cutter/] %
# test/ ディレクトリ中のテストを cutter で実行するために，
# 次のコマンドを実行してください
cutter -v v test/
#+END_SRC

#+RESULTS:
#+BEGIN_SRC sh
test_first:
  test_condition:					.: (0.000125)
  test_strcmp:						.: (0.000044)

Finished in 0.001260 seconds (total: 0.000169 seconds)

2 test(s), 2 assertion(s), 0 failure(s), 0 error(s), 0 pending(s), 0 omission(s), 0 notification(s)
100% passed
#+END_SRC



** テスト結果 (成功)
#+BEGIN_example
test_first:
  test_condition:					.: (0.000062)
  test_strcmp:						.: (0.000025)

Finished in 0.000775 seconds (total: 0.000087 seconds)

2 test(s), 2 assertion(s), 0 failure(s), 0 error(s), 0 pending(s), 0 omission(s), 0 notification(s)
100% passed
#+end_example

  上のテスト結果の出力を要約すると:
#+BEGIN_QUOTE
  テストファイル test_first にある，ふたつのテスト関数 test_condition,
  test_strcmp の中，ふたつの表明を実行し，失敗はありませんでした。
#+END_QUOTE
  詳しい結果の見方については，[[http://cutter.sourceforge.net/reference/ja/readme.html][はじめに: Cutterリファレンスマニュアル - Cutter]] を読んでください。

