org/org-docs/cutter.html

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">4.2</span> ヘッダファイルやライブラリファイルの場所</h3>
<div class="outline-text-3" id="text-4-2">
<p>
cutter.h や libcutter.so の在処を調べてみましょう:
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#27425;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12375;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">cutter.h &#12364;&#12354;&#12427;&#22580;&#25152;&#12364;&#12431;&#12363;&#12426;&#12414;&#12377;&#12290;</span>
locate cutter.h
</pre>
</div>

<p>
&lt;cutter.h&gt; は /usr/include/cutter/cutter.h ですね。
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#27425;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12375;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">libcutter.so &#12364;&#12354;&#12427;&#22580;&#25152;&#12364;&#12431;&#12363;&#12426;&#12414;&#12377;&#12290;</span>
locate libcutter.so
</pre>
</div>

<p>
-lcutter で指定した libcutter.so は /usr/lib/libbutter.so です。
/usr/lib はシステムの通常のライブラリを置く場所です。
</p>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">4.3</span> オブジェクト・ファイルのこと</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">[~/progs/cutter/test] % </span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">test_first.o &#12398;&#20013;&#12395;&#20309;&#12364;&#12354;&#12427;&#12363;&#35519;&#12409;&#12414;&#12375;&#12423;&#12358;&#12290;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#27425;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;e</span>

nm test_first.o
</pre>
</div>

<pre class="example">
000000000000036d s L_.str
00000000000003ad s L_.str1
00000000000003d0 s L_.str2
00000000000003eb s L_.str3
00000000000003f8 s L_.str4
0000000000000440 s L_.str5
000000000000046c s L_.str6
0000000000000473 s L_.str7
00000000000003ba s L___PRETTY_FUNCTION__.test_condition
000000000000042d s L___PRETTY_FUNCTION__.test_strcmp
                 U ___stack_chk_fail
                 U ___stack_chk_guard
00000000000005d0 b _condition
                 U _cut_assert_helper
0000000000000000 T _cut_setup
0000000000000010 T _cut_teardown
                 U _cut_test_context_current_peek
                 U _cut_test_context_finish_user_message_jump
                 U _cut_test_context_get_have_current_result
                 U _cut_test_context_get_jump_buffer
                 U _cut_test_context_in_user_message_jump
                 U _cut_test_context_long_jump
                 U _cut_test_context_pop_backtrace
                 U _cut_test_context_process_current_result
                 U _cut_test_context_push_backtrace
                 U _cut_test_context_set_jump_buffer
                 U _cut_test_context_set_user_message
                 U _cut_test_context_start_user_message_jump
                 U _setjmp
                 U _strcmp
0000000000000020 T _test_condition
00000000000001b0 T _test_strcmp
</pre>

<p>
test_first.o に入っている変数や関数，参照している関数情報などですね:
</p>
<ul class="org-ul">
<li>T は定義されている関数です</li>
<li>U は参照している関数です</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">4.4</span> ライブラリ・ファイルのこと</h3>
<div class="outline-text-3" id="text-4-4">
<p>
test_first.so をいろいろ調べてみましょう.
</p>

<p>
まずは，test_first.so が使用しているライブラリを調べてみます。
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">[~/progs/cutter/test] % </span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">test_first.so&#12364;&#20351;&#12358;&#21205;&#30340;&#12521;&#12452;&#12502;&#12521;&#12522;&#12434;&#34920;&#31034;&#12377;&#12427;&#12383;&#12417;&#65292;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#27425;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;</span>

ldd test_first.so
</pre>
</div>

<pre class="example">
	linux-vdso.so.1 =&gt;  (0x00007fff1f595000)
	libcutter.so.0 =&gt; /usr/lib/libcutter.so.0 (0x00007fc59afa4000)
	libc.so.6 =&gt; /lib/x86_64-linux-gnu/libc.so.6 (0x00007fc59abdf000)
	libgmodule-2.0.so.0 =&gt; /usr/lib/x86_64-linux-gnu/libgmodule-2.0.so.0 (0x00007fc59a9da000)
	libgio-2.0.so.0 =&gt; /usr/lib/x86_64-linux-gnu/libgio-2.0.so.0 (0x00007fc59a667000)
	libgobject-2.0.so.0 =&gt; /usr/lib/x86_64-linux-gnu/libgobject-2.0.so.0 (0x00007fc59a416000)
	libglib-2.0.so.0 =&gt; /lib/x86_64-linux-gnu/libglib-2.0.so.0 (0x00007fc59a10d000)
	libpthread.so.0 =&gt; /lib/x86_64-linux-gnu/libpthread.so.0 (0x00007fc599eef000)
	/lib64/ld-linux-x86-64.so.2 (0x00007fc59b456000)
	libdl.so.2 =&gt; /lib/x86_64-linux-gnu/libdl.so.2 (0x00007fc599ceb000)
	libz.so.1 =&gt; /lib/x86_64-linux-gnu/libz.so.1 (0x00007fc599ad1000)
	libselinux.so.1 =&gt; /lib/x86_64-linux-gnu/libselinux.so.1 (0x00007fc5998ae000)
	libresolv.so.2 =&gt; /lib/x86_64-linux-gnu/libresolv.so.2 (0x00007fc599693000)
	libffi.so.6 =&gt; /usr/lib/x86_64-linux-gnu/libffi.so.6 (0x00007fc59948a000)
	libpcre.so.3 =&gt; /lib/x86_64-linux-gnu/libpcre.so.3 (0x00007fc59924c000)
</pre>

<p>
つぎに test_first.so の中に何が入っているか調べてみます:
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">[~/progs/cutter/test] % </span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">test_first.so&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#65292;&#12414;&#12383;&#12399;&#21442;&#29031;&#12375;&#12390;&#12356;&#12427;&#38306;&#25968;&#12434;&#34920;&#31034;&#12377;&#12427;&#12383;&#12417;&#65292;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#27425;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;</span>

nm test_first.so
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">5</span> テストの実行</h2>
<div class="outline-text-2" id="text-5">
<p>
作成したテストを実行します:
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">[~/progs/cutter/] %</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">test/ &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#20013;&#12398;&#12486;&#12473;&#12488;&#12434; cutter &#12391;&#23455;&#34892;&#12377;&#12427;&#12383;&#12417;&#12395;&#65292;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#27425;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;</span>
cutter -v v test/
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">test_first:
  test_condition:                                       .: (0.000125)
  test_strcmp:                                          .: (0.000044)

Finished<span style="color: #0000FF;"> in</span> 0.001260 seconds (total: 0.000169 seconds)

2 test(s), 2 assertion(s), 0 failure(s), 0 error(s), 0 pending(s), 0 omission(s), 0 notification(s)
100% passed
</pre>
</div>
</div>



<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">5.1</span> テスト結果 (成功)</h3>
<div class="outline-text-3" id="text-5-1">
<pre class="example">
test_first:
  test_condition:					.: (0.000062)
  test_strcmp:						.: (0.000025)

Finished in 0.000775 seconds (total: 0.000087 seconds)

2 test(s), 2 assertion(s), 0 failure(s), 0 error(s), 0 pending(s), 0 omission(s), 0 notification(s)
100% passed
</pre>

<p>
上のテスト結果の出力を要約すると:
</p>
<blockquote>
<p>
テストファイル test_first にある，ふたつのテスト関数 test_condition,
test_strcmp の中，ふたつの表明を実行し，失敗はありませんでした。
</p>
</blockquote>
<p>
詳しい結果の見方については，<a href="http://cutter.sourceforge.net/reference/ja/readme.html">はじめに: Cutterリファレンスマニュアル - Cutter</a> を読んでください。
</p>
</div>
</div>
