org/org-docs/cutter/cutter.org
** テスト結果 (失敗)

  cut_assert の中の式を変えて，失敗する場合も試してみましょう。

#+BEGIN_EXAMPLE
test_first:
  test_condition:					F
=============================================================================================================================================================
Failure: test_condition
conditionの値はcut_setup()で1に設定されているはず
expected: <condition==0> is neither FALSE nor NULL
test_first.c:25: test_condition(): cut_assert(condition==0, )
=============================================================================================================================================================
: (0.000219)
  test_strcmp:						F
=============================================================================================================================================================
Failure: test_strcmp
同じ文字列に対し，strcmpは0を返すはず
expected: <strcmp("string", "string")==1> is neither FALSE nor NULL
test_first.c:32: test_strcmp(): cut_assert(strcmp("string", "string")==1, )
=============================================================================================================================================================
: (0.000096)

Finished in 0.000879 seconds (total: 0.000315 seconds)

2 test(s), 0 assertion(s), 2 failure(s), 0 error(s), 0 pending(s), 0 omission(s), 0 notification(s)
0% passed

#+END_EXAMPLE
