org/org-docs/cutter.html

<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">5.2</span> テスト結果 (失敗)</h3>
<div class="outline-text-3" id="text-5-2">
<p>
cut_assert の中の式を変えて，失敗する場合も試してみましょう。
</p>

<pre class="example">
test_first:
  test_condition:					F
=============================================================================================================================================================
Failure: test_condition
conditionの値はcut_setup()で1に設定されているはず
expected: &lt;condition==0&gt; is neither FALSE nor NULL
test_first.c:25: test_condition(): cut_assert(condition==0, )
=============================================================================================================================================================
: (0.000219)
  test_strcmp:						F
=============================================================================================================================================================
Failure: test_strcmp
同じ文字列に対し，strcmpは0を返すはず
expected: &lt;strcmp("string", "string")==1&gt; is neither FALSE nor NULL
test_first.c:32: test_strcmp(): cut_assert(strcmp("string", "string")==1, )
=============================================================================================================================================================
: (0.000096)

Finished in 0.000879 seconds (total: 0.000315 seconds)

2 test(s), 0 assertion(s), 2 failure(s), 0 error(s), 0 pending(s), 0 omission(s), 0 notification(s)
0% passed
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Masayuki Suzuki</p>
<p class="date">Created: 2016-11-01 火 05:08</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
